{"speaker-enrique-lopez-manas":{"firstname":"Enrique","lastname":"Lopez Manas","bio_html":"bit.ly/EnriqueLopezManas GDE, Android and Mobile developer since 2007. Author of a few books and freelancer.","www":"http://lopez-manas.com","twitter":"https://twitter.com/eenriquelopez","facebook":"","github":"https://github.com/kikoso","linkedin":"https://www.linkedin.com/in/eenriquelopez/?ppe=1","photo_url":"/images/speakers/enrique-lopez-manas.jpg"},"speaker-kamil-pyc":{"firstname":"Kamil","lastname":"Pyć","bio_html":"He is developing iOS applications for over 6 years. In work he strongly believes that everything can be automated and tested. In his free time he creates crazy projects during hackathons and travels around the world.","twitter":"https://twitter.com/KamilPyc","github":"https://github.com/PycKamil","photo_url":"/images/speakers/kamil_pyc.jpg"},"speaker-jorge-castillo":{"firstname":"Jorge","lastname":"Castillo","bio_html":"Jorge Castillo is an experienced Android Engineer from Spain, currently working at GoMore, an International product company from Copenhagen.\n\nHe is currently focused on promoting functional architectures for Android apps using Kotlin. He has talked about this topic on different events. He is also very active sharing Kotlin knowledge for the community on his Medium account:\n* https://medium.com/@JorgeCastilloPr/kotlin-purity-and-function-memoization-b12ab35d70a5\n* https://medium.com/@JorgeCastilloPr/tail-recursion-and-how-to-use-it-in-kotlin-97353993e17f\n* https://medium.com/@JorgeCastilloPr/kotlin-dependency-injection-with-the-reader-monad-7d52f94a482e\n\nHe will be attending Kotlinconf San Francisco 2017 with this same talk, and has also speaked in events like the Droidcon Greece 2016 at Thessaloniki, Mobilization Poland 2016, Codemotion Madrid 2016, Google I/O Extended Madrid 2016, or DevFest events from Jaén, Granada and Códoba.\n\n\n\n\n\n\n","photo_url":"/images/speakers/jorge-castillo.jpg","www":"https://medium.com/@jorgecastillopr","twitter":"https://twitter.com/jorgecastillopr","github":"https://github.com/jorgecastilloprz","linkedin":"https://www.linkedin.com/in/jorgecastilloprz"},"speaker-salomon-brys":{"firstname":"Salomon","lastname":"Brys","bio_html":"Passionate about Kotlin for the last three years, I am the developper and maintainer of the Kodein library.\nDeeply rooted in the Open-Source philosophy, I am dedicated to making tools and libraries to make programming easier, safer, and more exciting.\nI also love boardgaming and flying small planes (which I have a license for).","photo_url":"/images/speakers/salomon_b.jpg","www":"https://github.com/SalomonBrys/","twitter":"https://twitter.com/","github":"https://github.com/SalomonBrys","linkedin":"https://www.linkedin.com/in/salomonbrys"},"speaker-sergi-martinez":{"firstname":"Sergi","lastname":"Martinez","bio_html":"Working as Android dev at Schibsted and Google Developer Expert for Android. He loves to share, teach, discuss, learn with the community","photo_url":"/images/speakers/sergi_m.jpg","www":"http://sergiandreplace.com","twitter":"https://twitter.com/sergiandreplace","github":"https://github.com/sergiandreplace","linkedin":"https://www.linkedin.com/in/sergiandreplace"},"speaker-leandro-favarin":{"firstname":"Leandro","lastname":"Favarin","bio_html":"Leandro has been working as a software engineer for mobile devices and portable technology for 7+ years. His focus is on the Android platform and everything around it.","photo_url":"/images/speakers/leandro-favarin.jpg","www":"http://leandrofavarin.com","twitter":"https://twitter.com/leandrofavarin","github":"https://github.com/leandrofavarin","linkedin":"https://www.linkedin.com/in/leandrofavarin"},"speaker-vasiliy-zukanov":{"firstname":"Vasiliy","lastname":"Zukanov","bio_html":"Professional software engineer and blogger (www.techyourchance.com)","photo_url":"/images/speakers/vasiliy-zukanov.jpg","www":"http://www.techyourchance.com","twitter":"https://twitter.com/VasiliyZukanov"},"speaker-miguel-quinones":{"firstname":"Miguel","lastname":"Quinones","bio_html":"Miguel is a control systems engineer who turned to iOS and Cocoa many years ago. Attracted by the simplicity and power of Apple’s ecosystem, he never looked back. He writes code for fun, generating profit as a nice side-effect. He's worked on apps with millions MAUs like Badoo, Bumble and currently, Peak Brain Training.","www":"https://miqu.me","photo_url":"/images/speakers/miguel-quinones.jpg","github":"https://github.com/DarthMike","linkedin":"https://www.linkedin.com/in/miguelquinon"},"speaker-yuliya-kaleda":{"firstname":"Yuliya","lastname":"Kaleda","bio_html":"Yuliya is an Android developer at Jet.com, leading a team of 4 developers whose main focus is to build performant, scalable and cutting-edge Android projects. For the last few months Yuliya has been collaborating with Google to build the first multi-feature Instant App.","photo_url":"/images/speakers/yuliya_k.jpg","linkedin":"https://www.linkedin.com/in/yuliya-kaleda-b4525ab1"},"speaker-martin-mitrevski":{"firstname":"Martin","lastname":"Mitrevski","bio_html":"Martin is working as a Technical Coordinator at Swiss Software Company Netcetera. He’s been working on mobile apps in the areas of virtual reality, transport, indoor navigation, insurance, weather, innovation tools and live event apps. Lately, he's been fascinated by the possibilities that conversational interfaces bring in simplifying the user experience and how they might change the way we think about apps. ","photo_url":"/images/speakers/mitrevski.png","www":"https://martinmitrevski.com/","twitter":"https://twitter.com/mitrevski","github":"https://github.com/martinmitrevski","linkedin":"https://www.linkedin.com/in/martin-mitrevski-01134755/"},"speaker-elviro-rocca":{"firstname":"Elviro","lastname":"Rocca","bio_html":"Elviro worked for some years as a Materials Engineer before focusing on his true passion: functional programming. He is the lead iOS Developer @Facile.it and his main field of interest is applying functional concepts and techniques to real-world programming problems related to iOS and mobile platforms in general.","photo_url":"/images/speakers/rocca.jpg","www":"https://broomburgo.github.io/fun-ios/","twitter":"https://twitter.com/_logicist","github":"https://github.com/broomburgo","linkedin":"https://www.linkedin.com/in/elviro-rocca-045b1279"},"speaker-tomasz-gebarowski":{"firstname":"Tomasz","lastname":"Gebarowski","bio_html":"Software Engineer, currently working as an iOS Architect at mBank. Working full time in Swift. Having background in C/C++ and distributed VoIP servers. Experienced in maintaining large and long term projects. Privately father of two kids and LEGO enthusiast.","photo_url":"/images/speakers/tomasz-gebarowski.jpg","www":"http://www.codica.pl","twitter":"https://twitter.com/tgebarowski","github":"https://github.com/tgebarowski","linkedin":"https://www.linkedin.com/in/tomaszgebarowski"},"speaker-gautier-mechling":{"firstname":"Gautier","lastname":"Mechling","bio_html":"Software Developer","www":"http://nilhcem.com","photo_url":"/images/speakers/gautier-mechling.jpg","github":"https://github.com/Nilhcem","linkedin":"https://www.linkedin.com/in/gautier-mechling-9a0a7236/"},"speaker-michal-kowalczyk":{"firstname":"Michał","lastname":"Kowalczyk","bio_html":"Michał has worked in various sectors of IT for last 12 years. He has created web applications as well as embedded systems. In his job, he likes to combine various technologies. For the last couple of years, he has used C++ with Java, Python and Swift mixed in. Currently, he works in TomTom developing a multiplatform engine for map visualisation.","photo_url":"/images/speakers/mkowalczyk.jpg","linkedin":"https://www.linkedin.com/in/michalkowalczyk/"},"speaker-kamil-czopek":{"firstname":"Kamil","lastname":"Czopek","bio_html":"iOS developer, consultant, manager, online marketer. ","photo_url":"/images/speakers/czopek.jpg"},"speaker-rowdy-rabouw":{"firstname":"Rowdy","lastname":"Rabouw","bio_html":"Rowdy Rabouw is a webdeveloper with over 20 years’ experience in HTML, CSS, JavaScript and PHP.\n\nHe's been working as a freelancer since 2004 and has been employed by the Dutch insurance company Nationale-Nederlanden since 1992. Currently he is working on various JavaScript and NativeScript projects as Senior Engineer. \n\nRowdy started developing NativeScript apps with Angular in 2016 and running the NativeScript NL website; a curated list of courses, tools and tips to help people code awesome apps with NativeScript. \n\nSince 2017 he is a Telerik Developer Expert for NativeScript and spreading his love for {N}.","www":"http://double-r.nl","photo_url":"/images/speakers/rowdy-rabouw.jpg","github":"https://github.com/nativescriptnl","linkedin":"https://www.linkedin.com/in/rowdyrabouw"},"speaker-stuart-kent":{"firstname":"Stuart","lastname":"Kent","bio_html":"Hello! I'm a software developer with 3 years' mobile experience. I currently work at Detroit Labs creating native Android and iOS apps for national and international brands in the utilities, QSR, automotive, and pro audio industries. Before becoming a developer, I taught college and earned a Ph.D. in Applied Math. Likes: Enums. Dislikes: dogmatism.","www":"http://www.stkent.com","photo_url":"/images/speakers/stuart-kent.jpg","github":"https://github.com/stkent","linkedin":"https://www.linkedin.com/in/skentphd"},"speaker-olivier-destrebecq":{"firstname":"Olivier","lastname":"Destrebecq","bio_html":"I provide mobile strategy & development for teams creating their first mobile app (particularly iOS).\nAfter working for very large companies in the US I'm taking all that I learned in software development and using this to help my clients build great apps.\nI also build apps for own business and co-organize the mobile development meetup for the french riviera.","photo_url":"/images/speakers/olivier.png","www":"http://www.mobdesignapps.fr","twitter":"https://twitter.com/@otusweb","github":"https://github.com/otusweb","linkedin":"https://www.linkedin.com/in/olivierdestrebecq/"},"speaker-ewa-ludwiczak":{"firstname":"Ewa","lastname":"Ludwiczak","bio_html":"Ewa is software test engineer focused on mobile iOS app testing and development. In Allegro Group works in agile team where she continually improves her testing, programming and negotiation skills. Systematically shares her knowledge at local meetups like Geek Girls Carrots, PyLadies, PTAQ, WrotQA and conferences like Testwarez or Agile & Automation Days. Certified SCRUM devotee and dance lover.","photo_url":"/images/speakers/ewaludwiczak.png","twitter":"https://twitter.com/@ewabielskapoz","linkedin":"https://www.linkedin.com/in/ewa-ludwiczak-25268b54"},"speaker-lorenzo-quiroli":{"firstname":"Lorenzo","lastname":"Quiroli","bio_html":"Lorenzo is Android Developer who started from Java and then saw the light thanks to Kotlin, which he has already used in several production apps. He is currently working in London @busuu","photo_url":"/images/speakers/lorenzo.png","twitter":"https://twitter.com/lorenzoquiroli","github":"https://github.com/quiro91"},"speaker-eliasz-sawicki":{"firstname":"Eliasz","lastname":"Sawicki","bio_html":"I'm developer at Bright Inventions, focused on providing great iOS experience. I’m constantly looking for new ways to improve my solutions which is also main topic of my blog. When my Mac is sleeping, I’m probably playing guitar or reading books.","photo_url":"/images/speakers/eliasz-sawicki.png","www":"http://eliaszsawicki.com/","twitter":"https://twitter.com/@elisawic","github":"https://github.com/Eluss","linkedin":"https://www.linkedin.com/in/eliasz-sawicki-499953a2"},"speaker-saul-diaz":{"firstname":"Saúl","lastname":"Díaz","bio_html":"Saúl Díaz has been developing Android since 2010. Currently he is working on Chicisimo, and Android app selected as one of the best of 2015 on Spain, and featured on Google Play by the Google Play Team. Previously he has worked as Android Lead on Fever and Android Developer on Tuenti, two renowned companies of Spain. He is an active member of the Spanish Android Development community and regularly participates in events and conferences.","photo_url":"/images/speakers/saul-diaz.jpg","twitter":"https://twitter.com/@sefford","github":"https://github.com/Sefford/","linkedin":"https://www.linkedin.com/in/sefford/"},"speaker-marcin-moskala":{"firstname":"Marcin","lastname":"Moskała","bio_html":" Kotlin developer and passionate for over 2 years. Making open-source libraries (ActivityStarter, PreferenceHolder, KotlinDiscreteMathToolkit) and applications both for GameKit and as a freelancer. Also writing articles for programming magazines and making speeches on different events. ","photo_url":"/images/speakers/marcin-moskala.jpg","www":"http://marcinmoskala.com/","github":"https://github.com/MarcinMoskala"},"speaker-pawel-gajda":{"firstname":"Paweł","lastname":"Gajda","bio_html":"Associated with Android since 2010, when platform was taking its first steps in the global market. Enthusiast of JetBrains products such as IntelliJ IDEA and Kotlin. Laureate of the national finals of Microsoft Imagine Cup 2013. Focuses on lifehacking and improving his productivity. Speaker at mobile conferences. After-hours open source contributor (author of KAndroid - a kotlin library for Android), amateur runner and guitar player.","photo_url":"/images/speakers/pawel-gajda.jpg","www":"http://www.pawegio.com/","twitter":"https://twitter.com/@pawegio","github":"https://github.com/pawegio"},"speaker-raul-portales":{"firstname":"Raul","lastname":"Portales","bio_html":"Raul Portales is a Software Engineer working on mobile since the early times. He switched from Symbian to Android in 2009 (before Android versions had tasty names) and never looked back. He loves public speaking and has presented at several DroidCons, Game Developer Conferences and many GDGs.\n\nAfter working a lot on the front end - especially building games - Raul has developed a special interest in UX and UI.","www":"http://plattysoft.com","photo_url":"/images/speakers/raulportales.jpg","github":"https://github.com/plattysoft","linkedin":"https://www.linkedin.com/in/raulportales"},"speaker-marcin-zbijowski":{"firstname":"Marcin","lastname":"Zbijowski","bio_html":"I'm iOS developer since iPhone OS 3 and doing apps since then.","photo_url":"/images/speakers/zbijowski.png","twitter":"https://twitter.com/zbiju","github":"https://github.com/marcin-zbijowski","linkedin":"https://www.linkedin.com/in/marcinzbijowski/"},"speaker-krzysztof-siejkowski":{"firstname":"Krzysztof","lastname":"Siejkowski","bio_html":"iOS developer at Polidea, a hardware-friendly software house in Warsaw. Co-organizer of Mobile Warsaw, a community for mobile developers. Swift enthusiast. A cultural anthropologist by training, happy to discuss the human side of programming techniques.","photo_url":"/images/speakers/ksiejkowski.jpg","www":"https://siejkowski.net","twitter":"https://twitter.com/@_siejkowski","github":"https://github.com/siejkowski","linkedin":"https://www.linkedin.com/in/krzysztof-siejkowski-99828025"},"speaker-yusei-nishiyama":{"firstname":"Yusei","lastname":"Nishiyama","bio_html":"Yusei Nishiyama is a senior iOS developer at Cookpad the largest recipe sharing service in the world with the aim of making everyday cooking fun! He majored in philosophy and aesthetics but the beauty of programming languages led him to become a programmer and he has now been working with iOS since 2012.\n\nWhen he isn’t coding, he is spending some time listening to and making music. You can find him playing jazz piano in a pub.","photo_url":"/images/speakers/yuseinishiyama.png","twitter":"https://twitter.com/@yuseinishiyama","github":"https://github.com/yuseinishiyama","linkedin":"https://www.linkedin.com/in/yusei-nishiyama-6b45299b"},"speaker-sam-bellen":{"firstname":"Sam","lastname":"Bellen","bio_html":"I'm a front-end developer at madewithlove, a small app development company based in Belgium, but with employees all over the world. \n\nFor my day to day job I'm in charge of creating challenging user interfaces and make applications nice to work with. \nAfter office hours I like to play around with the web-audio API, and other \"exotic\" browser APIs. One of my side projects is a library to add audio effects to an audio input using JavaScript.\n\nWhen I'm not behind a computer, you can find me playing the guitar, having a beer at a concert, or trying to snap the next perfect picture.","www":"https://blog.sambego.be/","photo_url":"/images/speakers/sam-bellen.jpg","twitter":"https://twitter.com/sambego","github":"https://github.com/sambego"},"speaker-gabor-wnuk":{"firstname":"Gabor","lastname":"Wnuk","bio_html":"For the last 10 years bonded with o2.pl and later Grupa Wirtualna Polska. Currently Mobile Tech Lead at Grupa Wirtualna Polska, busy with implementing React Native wherever possible.","photo_url":"/images/speakers/wnuk.jpg","www":"https://gabo.re/"}}